INSERT INTO ТРАНСПОРТ(
	НОМЕР_ТРАНСПОРТНОГО_СРЕДСТВА, 
	ГАРАЖНЫЙ_НОМЕР,
	ТИП_ТРАНСПОРТА,
	ГОД_ВЫПУСКА_ТРАНСПОРТА,
	ДАТА_ТЕХОСМОТРА,
	КОЛИЧЕСТВО_ПОСАДОЧНЫХ_МЕСТ,
	НОМЕР_МАРШРУТА,
	НОМЕР_ДЕПО)
VALUES
	('34A356', '11','АВТОБУС', '2015-10-20', '2022-12-05', 40, 6,'45А'),
	('36B134', '12','МИКРОАВТОБУС', '2018-05-12', '2021-10-01', 20, 3,'56В'),
	('32C327', '14','МИКРОАВТОБУС', '2019-08-17', '2020-11-12', 20, 4,'45А');


INSERT INTO СОТРУДНИКИ (
	ТАБЕЛЬНЫЙ_НОМЕР,
	ИМЯ,
	ОТЧЕСТВО,
	ФАМИЛИЯ,
	ДОЛЖНОСТЬ,
	СТАЖ_РАБОТЫ,
	ДАТА_ПРИЕМА_НА_РАБОТУ,
	ПОЛ,
	ДАТА_РОЖДЕНИЯ)
VALUES
	(123,'ПЕТР','ПЕТРОВИЧ','ПЕТРОВ','ВОДИТЕЛЬ','12 ЛЕТ','2019-08-17','М','1985-05-13'),
	(124,'ВАЛЕРИЙ','ВАЛЕРЬЕВИЧ','ВАЛЕРЬЕВ','ВОДИТЕЛЬ','14 ЛЕТ','2018-08-15','М','1983-02-11'),
	(121,'МАРИЯ','ФЕДОРОВНА','ИВАНОВА','КОНДУКТОР','10 ЛЕТ','2019-09-17','Ж','1973-01-15'),
	(126,'СЕРАФИМА','ИВАНОВНА','КУКОЛКИНА','КОНДУКТОР','8 ЛЕТ','2020-03-04','Ж','1970-09-05');
 

INSERT INTO КОНТАКТНЫЕ_ДАННЫЕ_СОТРУДНИКОВ(
    ТАБЕЛЬНЫЙ_НОМЕР,
    ГОРОД,
    УЛИЦА,
    НОМЕР_ДОМА,
    НОМЕР_КВАРТИРЫ,
    НОМЕР_ТЕЛЕФОНА,
    КОММЕНТАРИЙ)
VALUES
	(123,'ЧЕРЕМУШКИ','УЛ. РАДУЖНАЯ','4','','+34-34-456738',''),
	(124,'ЧЕРЕМУШКИ','УЛ. СОЛНЕЧНАЯ','12','34','+34-34-45735',''),
	(121,'НИЖНИЕ ЧЕРЕМУШКИ','УЛ. ЛЕСНАЯ','48-А','36','+34-34-42910',''),
	(126,'ВЕРХНИЕ ЧЕРЕМУШКИ','УЛ. ОЗЕРНАЯ','34','','+34-34-44535','');
	
INSERT INTO УДОСТОВЕРЕНИЯ(
    ТАБЕЛЬНЫЙ_НОМЕР,
    ВИД_УДОСТОВЕРЕНИЯ,
    НОМЕР_УДОСТОВЕРЕНИЯ,
    ДАТА_ВЫДАЧИ,
    ДАТА_ЭКСПИРАЦИИ,
    КОММЕНТАРИЙ)
VALUES
	(123,'ВОДИТЕЛЬСКОЕ','AB25436F','2015-08-16','2023-08-17','КАТЕГОРИЯ D,C'),
	(124,'ВОДИТЕЛЬСКОЕ','AC24367F','2014-01-12','2025-12-01','КАТЕГОРИЯ B,D,C'),
	(121,'КОНДУКТОРСКОЕ','4734645-1','2015-10-23','2024-08-09',''),
	(126,'КОНДУКТОРСКОЕ','3245367-2','2017-11-18','2025-11-19','');


INSERT INTO ГРАФИК_РАБОТЫ(
    ТАБЕЛЬНЫЙ_НОМЕР,
    ПОНЕДЕЛЬНИК,
	ВТОРНИК,
	СРЕДА,
	ЧЕТВЕРГ,
	ПЯТНИЦА,
	СУББОТА,
	ВОСКРЕСЕНЬЕ,
	НОМЕР_МАРШРУТА,
	ВРЕМЯ_ВЫХОДА_НА_МАРШРУТ,
    ВРЕМЯ_ОКОНЧАНИЯ_РАБОТЫ)
VALUES
	(123,'+','','+','','+','','+','6','06:30:00','23:30:00'),
	(124,'','+','','+','','+','','3','06:30:00','23:50:00'),
	(121,'+','','+','','+','','+','6','06:30:00','23:30:00'),
	(126,'','+','','+','','+','','3','06:30:00','23:50:00');

INSERT INTO РАСПИСАНИЕ(
    ГАРАЖНЫЙ_НОМЕР,
    НОМЕР_МАРШРУТА,
   	ОСТАНОВКА,
	ВРЕМЯ_ПРИБЫТИЯ,
    ВРЕМЯ_ПРИБЫТИЯ1,
    ВРЕМЯ_ПРИБЫТИЯ2,
    ВРЕМЯ_ПРИБЫТИЯ3)  
VALUES
('11','6','ДЕСАНТНАЯ','06:30:00','13:17:00','13:27:00','22:07:00'),
('11','6','КИРПИЧНАЯ','06:45:00','12:55:00','13:41:00','21:35:00'),
('11','6','ОЗЕРНАЯ','07:00:00','12:33:00','13:55:00','21:03:00'),
('11','6','ГЕРШОНЫ','07:15:00','12:11:00','14:09:00','20:31:00'),
('11','6','СИРЕНЕВАЯ','07:30:00','11:49:00','14:23:00','19:59:00'),
('11','6','АРКАДИЯ','07:45:00','11:27:00','14:37:00','19:27:00'),
('11','6','ФОРТ','08:00:00','11:05:00','14:51:00','18:55:00'),
('11','6','ВОЛЫНКА','08:15:00','10:43:00','15:05:00','18:23:00'),
('11','6','ПРИБУЖСКАЯ','08:30:00','10:21:00','15:19:00','17:51:00'),
('11','6','ГРИБОЕДОВА','08:45:00','09:59:00','15:33:00','17:19:00'),
('11','6','САЛЬНИКОВА','09:00:00','09:37:00','15:47:00','16:47:00'),
('11','6','МАХНОВИЧА','09:15:00','09:18:00','16:01:00','16:15:00'),
('12','3','ЦУМ','06:30:00','12:06:00','13:11:00','22:21:00'),
('12','3','ЛЕНИНА','06:41:00','11:49:00','13:39:00','22:04:00'),
('12','3','СКВЕР','06:52:00','11:32:00','14:07:00','21:47:00'),
('12','3','ОВЕЧКИНА','07:03:00','11:15:00','14:35:00','21:30:00'),
('12','3','ПАРК','07:14:00','10:58:00','15:03:00','21:13:00'),
('12','3','МОСТОВАЯ','07:25:00','10:41:00','15:31:00','20:56:00'),
('12','3','МАТРОСОВА','7:36:00','10:24:00','15:59:00','20:39:00'),
('12','3','ВЕСЕЛАЯ','07:47:00','10:07:00','16:27:00','20:22:00'),
('12','3','ПРИГОРОДНАЯ','07:58:00','09:50:00','16:55:00','20:05:00'),
('12','3','АДАМКОВСКАЯ','08:09:00','09:33:00','17:23:00','19:48:00'),
('12','3','ПОЧТА','08:20:00','09:16:00','17:51:00','19:31:00'),
('12','3','АКИМОЧКИНА','08:31:00','8:59:00','18:19:00','19:14:00'),
('12','3','ДВОРНИКОВА','08:39:00','08:42:00','18:47:00','18:57:00');

INSERT INTO ДЕПО(
    НОМЕР_ДЕПО,
    ГОРОД,
    УЛИЦА,
    НОМЕР_ЗДАНИЯ,
    НОМЕР_ТЕЛЕФОНА,
    ФАКС,
    КОММЕНТАРИЙ)
VALUES
	('42','ЧЕРЕМУШКИ','УЛ.ДЕСАНТНАЯ','45А','+34-34-2-34','+645-263-2-23',''),
	('64','ЧЕРЕМУШКИ','УЛ.ЦЕНТРАЛЬНАЯ','56В','+34-3445635','+35-26453543','');

INSERT INTO ЗАРАБОТНАЯ_ПЛАТА(
    ТАБЕЛЬНЫЙ_НОМЕР,
    ОКЛАД,
    КОММЕНТАРИЙ)
VALUES
    (123,5000,''),
	(124,6000,''),
	(121,4000,''),
	(126,4000,'');


