{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## **Урок 4. Словари, множества и профилирование**\n",
    "\n",
    "**ДОМАШНЯЯ РАБОТА**\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 22:** Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.\n",
    "Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[2, 16, 6, 15, 5, 19, 14, 12, 12, 14, 19, 18] \n",
      " [4, 4, 12, 4, 18, 5, 11, 2, 20, 20, 8, 17]\n",
      "2 5 6 12 14 15 16 18 19 \n",
      " 2 4 5 8 11 12 17 18 20\n",
      " Общие элементы двух множеств {2, 18, 12, 5}\n"
     ]
    }
   ],
   "source": [
    "import random\n",
    "# создать 2 списка\n",
    "MyList1  = []\n",
    "MyList2 = []\n",
    "Set_length = int(input(\"Введите длину множества: \"))\n",
    "# Заполнить рандомно целыми числами\n",
    "MyList1 = [random.randint(1,20) for _ in range(Set_length)]\n",
    "MyList2 = [random.randint(1,20) for _ in range(Set_length)]\n",
    "print(MyList1,\"\\n\",MyList2)\n",
    "# схлопнуть в множество то что пересекается (функция пересечения множеств). отсортировать\n",
    "MyList1 = set(MyList1)\n",
    "MyList2 = set(MyList2)\n",
    "print(*MyList1,\"\\n\",*MyList2)\n",
    "Intersection_set = MyList1.intersection(MyList2)\n",
    "print(f' Общие элементы двух множеств {Intersection_set}')\n",
    "\n"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.\n",
    "\n",
    "Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло ai ягод.\n",
    "\n",
    "В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.\n",
    "\n",
    "Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите количество кустов от 3 до 1000: \n",
      "Количество кустов  23\n",
      "Вывожу количество ягод на каждом кусте: [93, 1, 55, 66, 88, 43, 33, 53, 46, 71, 69, 84, 60, 79, 36, 18, 22, 60, 73, 26, 83, 1, 14]\n",
      "Максимальная сумма ягод, которые возможно собрать за один заход: 224\n"
     ]
    }
   ],
   "source": [
    "# задача - найти макс сумму куста и 2 соседних\n",
    "import random\n",
    "print(\"Введите количество кустов от 3 до 1000: \")\n",
    "numberShrubs = int(input(\"Введите количество кустов\"))\n",
    "CurSum = 0\n",
    "MaxSum = 0\n",
    "i = 0\n",
    "while (numberShrubs < 3 or numberShrubs > 1000):\n",
    "    print(\"\\nКоличество кустов должно быть от 3 до 1000\\nвведите верное значение: \")\n",
    "    numberShrubs = int(input(\"Введите количество кустов\"))\n",
    "\n",
    "print (f\"Количество кустов  {numberShrubs}\")\n",
    "CountBerrys = []\n",
    "# Заполним список рандомно (сколько ягод на каждом кусте)\n",
    "CountBerrys = [random.randint(1,100) for _ in range(numberShrubs)]\n",
    "print(f\"Вывожу количество ягод на каждом кусте: {CountBerrys}\")\n",
    "# нужно проитерироваться и складывать соседние элементы. типа индекс 0, значит -1+0+1 и определить макс с умму\n",
    "for shrub in range(numberShrubs-1):\n",
    "   CurSum = CountBerrys [shrub] + CountBerrys[shrub-1] + CountBerrys[shrub+1]\n",
    "   if CurSum > MaxSum:\n",
    "       MaxSum = CurSum\n",
    "print(f\"Максимальная сумма ягод, которые возможно собрать за один заход: {MaxSum}\")\n"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.11.1"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
