{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 2:** Найдите сумму цифр трехзначного числа.\n",
    "\n",
    "*Пример:*\n",
    "\n",
    "123 -> 6 (1 + 2 + 3)\n",
    "\n",
    "100 -> 1 (1 + 0 + 0) |"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Что то пошло не так, возможно cat - это не число\n"
     ]
    }
   ],
   "source": [
    "# приму число в виде строки для проверки длины. \n",
    "number = input(\"Введите трехзначное число: \")\n",
    "\n",
    "while len(number) != 3:\n",
    "    print(f\"Ошибка! {number} - это не корректные данные\")\n",
    "    number = input(\"Введите корректное число (трехзначное): \")\n",
    "    \n",
    "# проработаю ситуацию где длинна 3, но пользователь ввел символы\n",
    "try:\n",
    "    sum = int(number[0]) + int(number[1]) + int(number[2])\n",
    "    print(\"Сумма цифр трехзначного числа\", number, \"равна\", sum)\n",
    "except ValueError:\n",
    "    print(f\"Что то пошло не так, возможно {number} - это не число\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 4:** Петя, Катя и Сережа делают из бумаги журавликов. Вместе они сделали S журавликов. Сколько журавликов сделал каждый ребенок, \n",
    "\n",
    "если известно, что Петя и Сережа сделали одинаковое количество журавликов, а Катя сделала в два раза больше журавликов, чем Петя и Сережа вместе?\n",
    "\n",
    "*Пример:*\n",
    "\n",
    "6 -> 1  4  1\n",
    "\n",
    "24 -> 4  16  4\n",
    "\n",
    "60 -> 10  40  10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Введите четное число, которое больше или равное 6 (шести)\n",
      "Мальчики сделали по 4 журавликов, а Катя сделала 16\n"
     ]
    }
   ],
   "source": [
    "# запрошу общее количество журавликов\n",
    "s = input(\"Введите число журавликов, которое сделали дети: \")\n",
    "# s = 2*x + 2(2*x) = 6x\n",
    "# все числа, которые делятся на 6 четные\n",
    "# юзер может ввести символы\n",
    "try:\n",
    "    while int(s) < 6 or int(s) % 2!= 0:\n",
    "        print(\"Введите четное число, которое больше или равное 6 (шести)\")\n",
    "        s = input(\"Введите четное число журавликов, которое равно или первышает 6: \")\n",
    "    print(f\"Мальчики сделали по {round(int(s)/6)} журавликов, а Катя сделала {round((int(s)/6)*4)}\")\n",
    "except ValueError:\n",
    "    print(f\"Что-то пошло не так. возможно {s} - это не число\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 6:** Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. \n",
    "\n",
    "Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. \n",
    "\n",
    "Т.е. билет с номером 385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написать программу, которая проверяет счастливость билета.\n",
    "\n",
    "*Пример:*\n",
    "\n",
    "385916 -> yes\n",
    "\n",
    "123456 -> no\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 56,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Сумма чисел 385  = 16\n",
      "Сумма чисел 916  = 16\n",
      "Билет номер 385916 - счастливый\n"
     ]
    }
   ],
   "source": [
    "# приму в форме строки для того чтобы оценить длину функцией len()\n",
    "ticket = input(\"Введите номер билета: \")\n",
    "# что если введет не 6 знасчный. обработаем\n",
    "while len(ticket) != 6:\n",
    "    print(f\"Ошибка. Вы ввели {ticket}, а это не номер билета\")\n",
    "    ticket = input(\"Введите корректный шестизначный номер: \")\n",
    "# просуммируем элементы  (по 3 числа с каждой стороны) конвертируя их в инты\n",
    "sum_left = int(ticket[0])+ int(ticket[1]) + int(ticket[2])\n",
    "sum_right = int(ticket[3]) + int(ticket[4]) + int(ticket[5])\n",
    "# проверка на здравый смысл (можно удалить)\n",
    "print(f\"Сумма чисел {ticket[:3]}  = {sum_left}\") \n",
    "print(f\"Сумма чисел {ticket[3:]}  = {sum_right}\")\n",
    "# ветвление с проверкой на равенство двух сумм\n",
    "if (sum_left == sum_right):\n",
    "    print(f\"Билет номер {ticket} - счастливый\")\n",
    "else:\n",
    "    print(\"Везение не на вашей стороне\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 8:** Требуется определить, можно ли от шоколадки размером n × m долек отломить k долек, если разрешается сделать один разлом \n",
    "\n",
    "по прямой между дольками (то есть разломить шоколадку на два прямоугольника).\n",
    "\n",
    "*Пример:*\n",
    "\n",
    "3 2 4 -> yes\n",
    "\n",
    "3 2 1 -> no"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "###\n",
      "###\n",
      "Да, можно отломить 4 долек\n"
     ]
    }
   ],
   "source": [
    "# функция рисует кусочки шоколадки\n",
    "def print_square(m,n):\n",
    "    # для каждой строки\n",
    "    for i in range(n):\n",
    "        # Для каждого столбца\n",
    "        for j in range(m):\n",
    "            #  рисовать кусочки\n",
    "            print(\"#\", end=\"\")\n",
    "        print()\n",
    "              \n",
    "n = int(input(\"Введите количество долек по оси х: \"))\n",
    "m = int(input(\"Введите количество долек по оси у: \"))\n",
    "k = int(input(\"Введите количество долек, которое нужно отломить: \"))\n",
    "# наша шоколадка\n",
    "print_square(m,n)\n",
    "\n",
    "# Проверяем, можно ли отломить k долек (количество долек должно делиться на сторону(либо одну, либо другую) без остатка \n",
    "# шоколадка должна быть не меньше чем кол-во долек)\n",
    "if k <= n * m and (k % n == 0 or k % m == 0):\n",
    "    print(\"Да, можно отломить\", k, \"долек\")\n",
    "else:\n",
    "    print(\"Нет, нельзя отломить\", k, \"долек\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.11.1"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
