{
 "cells": [
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## **Урок 2. Циклы (for, while)**\n",
    "#### ДОМАШНЯЯ РАБОТА"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 10:** На столе лежат n монеток. Некоторые из них лежат вверх решкой, а некоторые – гербом. \n",
    "\n",
    "Определите минимальное число монеток, которые нужно перевернуть, чтобы все монетки были повернуты вверх одной и той же стороной. \n",
    "\n",
    "Выведите минимальное количество монет, которые нужно перевернуть"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Наши 12 монет лежат следующим образом ['Решка', 'Решка', 'Орел', 'Орел', 'Решка', 'Решка', 'Решка', 'Решка', 'Решка', 'Орел', 'Решка', 'Орел']\n",
      "Минимальное количество монет, которое необходимо перевернуть для того чтобы они лежали одной стороной:4\n"
     ]
    }
   ],
   "source": [
    "# импортну рандом\n",
    "import random\n",
    "# принять количество монет с консоли. Часть лежит решкой. часть гербом вверх (судя по всему в ход идет рандом)\n",
    "try:\n",
    "    number_of_coins = int(input(\"Введите количество монет: \"))\n",
    "    # создам пустой список для добавления разныхх сторон монет\n",
    "    coins_list = []\n",
    "    # циклом буду рандомно выбрасывать монетку и класть значение (сторону) в список\n",
    "    for coin in range(number_of_coins):\n",
    "        coin_side = coins_list.append(random.choice([\"Орел\", \"Решка\"]))\n",
    "    print(f\"Наши {number_of_coins} монет лежат следующим образом {coins_list}\")\n",
    "# посчитаю значения с помощью count()(сколько монеток лежат той или иной стороной)  \n",
    "# функцией min() выберу минимальное. это будет ответом на вопрос сколько минимум нужно перевернуть. \n",
    "    print(f\"Минимальное количество монет, которое необходимо перевернуть для того чтобы они лежали одной стороной: {min(coins_list.count('Орел'), coins_list.count('Решка'))}\")\n",
    "except ValueError:\n",
    "    print(\"Что-то пошло не так. Это не целое число\")"
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 12:** Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике. \n",
    "\n",
    "Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P. \n",
    "\n",
    "Помогите Кате отгадать задуманные Петей числа."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Первое число, которое загадал Петя: 5\n",
      "Второе число, которое загадал Петя: 6\n",
      "Первое число, которое загадал Петя: 6\n",
      "Второе число, которое загадал Петя: 5\n"
     ]
    }
   ],
   "source": [
    "# Получаем от Пети сумму и произведение двух чисел, каждое из которых меньше либо равное 1000 \n",
    "Sum = int(input(\"Введите сумму двух чисел: \"))\n",
    "Product = int(input(\"Введите произведение двух чисел: \"))\n",
    "# Раз уж задано ограничение в условии..предположим, что сумма не должна превышать 2000\n",
    "while Sum > 2000:\n",
    "    Sum = int(input(\"Введите сумму двух чисел не превышающую 2000: \"))\n",
    "    Product = int(input(\"Введите произведение двух чисел (до млн): \"))\n",
    "# Перебираем все пары чисел (и одно и второе) в диапазоне суммы первое число, произведения - второе число\n",
    "for number in range(Sum):\n",
    "    for number2 in range(Product):\n",
    "        # Если сумма и произведение пары чисел равны заданным значениям, то выводим результат и завершаем программу\n",
    "        if number + number2 == Sum and number * number2 == Product:\n",
    "            print(\"Первое число, которое загадал Петя:\", number)\n",
    "            print(\"Второе число, которое загадал Петя:\", number2)\n",
    "            "
   ]
  },
  {
   "attachments": {},
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "**Задача 14:** Требуется вывести все целые степени двойки (т.е. числа вида 2k), не превосходящие числа N."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "2 в степени 0 = 1\n",
      "2 в степени 1 = 2\n",
      "2 в степени 2 = 4\n",
      "2 в степени 3 = 8\n",
      "2 в степени 4 = 16\n",
      "Следующее возведение в степень превысит максимум - 24\n"
     ]
    }
   ],
   "source": [
    "# примем число от пользованиеля - ограничение результата возведения в степень двойки\n",
    "NumberMax = int(input(\"Введите максимальный результат возведения в степень двойки: \"))\n",
    "# текущая (начальная) степень - 0\n",
    "current_degree = 0\n",
    "# Используем оператор возведения в степень для проверки истинности условия по ограничению\n",
    "while 2 ** current_degree <= NumberMax:\n",
    "    ## Выводим результат возведения в каждую степень\n",
    "    print(f\"2 в степени {current_degree} = {2**current_degree}\")\n",
    "    # инкриментим степень пока while не вернет false\n",
    "    current_degree += 1\n",
    "print(f\"Следующее возведение в степень превысит максимум, равный {NumberMax}\")"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "name": "python",
   "version": "3.11.1"
  },
  "orig_nbformat": 4
 },
 "nbformat": 4,
 "nbformat_minor": 2
}
